{"personalproject":[
{ 
 "description":" <article><br><h2><a id=\"heading1\">Schedule Generator<a><\/h2><p>The program generates schedules. You tell the program business hours, and the days you want off,how many hours you want to work and randomly set if the person is going to open or close.<\/p><h3>The flow of the program.<\/h3><p>First, you set up the business hours.<\/p><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/schedule1.JPG\" height=\"586\" width=\"1222\"><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/schedule2.JPG\" height=\"600\" width=\"694\"><p>after setting the hours the program actually give the option to add an employee <\/p><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/schedule3.JPG\" height=\"577\" width=\"1226\"><p>Second, tell the program total hours and days off you need.<\/p><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/schedule4.JPG\" height=\"280\" width=\"444\"><p>Lastly, the program prints the schedule with the main screen you can modify the schedule as you please.<\/p><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/schedule5.JPG\" height=\"582\" width=\"1216\"><h3> Data class<\/h3><h4>Time Class<\/h4><p>The time class has the ability to accept time in am or pm and 24 hours. Also, the time gives the total hours and minutes the from the time. Time return a formatted string time.<\/p><div id=\"git1\"><\/div><script type=\"text\/javascript\">$(function() {('#git1','<script src=https://gist.github.com/salsando1/f11e1b814826fe2686b070057dfa774b.js><' + '/script>');});</script><h4>Schedule class<\/h4><p>Schedule class is the one who holds time. Also has the ability to add all the week minutes and hours. The schedule also has the ability to return a formatted string method the return a formatted schedule.<\/p><div id=\"git2\"><\/div><h4>Schedule Generator<\/h4><p>First, the class checks if requested working hours is in the range of business hours.<\/p><div id=\"git3\"><\/div><p>Second, working hours are divided randomly in the week, the way this actually works randomly get day subtract 30 minutes from working hours and add to date. Stop until working hours reach 0.<\/p><div id=\"git4\"><\/div><p>Lastly, randomly choose is going to open or closed. If open is selected start counting from opening else if closed is selected start counting from closed time.<\/p><div id=\"git5\"><\/div><h2><a id=\"heading2\">Timekeeping Android App with CRUD using SQLite <a><\/h2><p>This program store time and tells you hours and minutes you have made so far.<\/p><h3>The flow of the program.<\/h3><p>The main screen shows all the hours you did so far.<\/p><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/TimeKeeping1.PNG\" height=\"1093\" width=\"583\"><p>If you want to see the total hours you did on a day you can touch the date and dialog will show you time and total hours for the day. You can add another time by touching the plus sign in the dialog.<\/p><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/TimeKeeping2.PNG\" height=\"1089\" width=\"564\"><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/TimeKeeping3.PNG\" height=\"1079\" width=\"559\"><p>If you want to add another date you can do that on the main screen. This screen shows you a calendar as well. The program also can delete all records or delete by date. <\/p><img src=\"http:\/\/ssandoval114.com\/jsonFiles\/TimeKeeping5.PNG\" height=\"1096\" width=\"560\"><h3> Class the handle data<\/h3><h4>TimeKeepingCursorAdapter Class<\/h4><p>We use a simple cursor adapter. This class helps us to put data in a listview.<\/p><div id=\"git6\"><\/div><h4>TimeKeepinginDbAdapter Class<\/h4><p>This class is the one who queries the database.<\/p><div id=\"git7\"><\/div><h2><a id=\"heading3\">Portfolio Website<a><\/h2><h3> Floatdiv<\/h3><p>The code check when the top of the browser reaches the main content then div start moving to the top of thebrowser. If you pass the top of main content then stop and stay there.<\/p><div id=\"git8\"><\/div><h3>Button action<\/h3><p>Since the website uses Ajax.  The h2 constantly changes then JavaScript copy and create a new anchor. Also, this same part adds a new title to floatdiv that relate to what you seeing.<\/p><div id=\"git9\"><\/div><h3>Listener for h2<\/h3><p>The listener make a change to anchor on floatdiv, every time top  of browser pass h2<p\/><div id=\"git10\"><\/div><br><\/article>"
}
]}